/*请补充main函数,该函数的功能是:如果数组aa的前一个元素比后一个元素小,则把它保存在数组bb中并输出。 
例如,输入"40,51,62,33,35,52,48,95,66,73",则结果输出"40,51,33,35,48,66"。 
注意:请勿改动main函数和其他函数中的任何内容,仅在main函数的横线上填入所编写的若干表达式或语句。 试题程序:*/ 
#include <stdio.h>
#define N 10
int main()
{
	 int i,n=0;
	 int aa[N]={40,51,62,33,35,52,48,95,66,73};
	 int bb[N];
/**********FILL**********/
	 for(i=0;i<N - 1;i++)
		if(aa[i]<aa[i+1])
/**********FILL**********/
			bb[n++]=aa[i];
	 printf("\n*** display bb ***\n");
	 for (i=0;i<n;i++)
/**********FILL**********/
		printf("bb[%d]=%2d ",i, bb[i]);
return 0;
}